app/controllers/main_controller.rb

INSERT INTO "posts" ("msg", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["msg", "eiei"], ["user_id", 1], ["created_at", "2021-09-02 10:09:28.832304"], ["updated_at", "2021-09-02 10:09:28.832304"]]
---
  def post
    Post.create(user_id:params[:user_id],msg:params[:msg])

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def read
    @posts=User.find(params[:user_id]).posts
    @user=User.find(params[:user_id])